export const RegexValidate = {
  fullName:
    /^[a-zA-ZÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂưăạảấầẩẫậắằẳẵặẹẻẽềềểỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệếỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷỹ'’\s]+$/,
  idNumber:
    /^[A-Za-z0-9]{8}(?:[A-Za-z0-9]{4})?$|^[A-Za-z0-9]{8}(?:[A-Za-z0-9]{1})?$/,
  phoneNumber: /0(1[1-9]|2[1-9]|3[1-9]|4[1-9]|5[1-9]|6[1-9]|7[0|1-9]|8[1-9]|9[1-9])(\d{7})\b/,
  otherFormInput: /^(?!\s*$).+/,
  email: /^[\w\-\.]+@([\w-]+\.)+[\w-]{2,4}$/,
  passwordNumber: /^[0-9]*$/,
  validDateFormatDDMMYYYY:
    /(((0|1)[0-9]|2[0-9]|3[0-1])\/(0[1-9]|1[0-2])\/((19|20)\d\d))$/,
  idCard: /^(?:[0-9a-zA-Z]{8}|[0-9a-zA-Z]{9}|[0-9a-zA-Z]{12})$/,
  daudit: /^\S.*[^.\s]$/,
  validIsoDate:
    /^\d{4}-\d\d-\d\dT\d\d:\d\d:\d\d(\.\d+)?(([+-]\d\d:\d\d)|Z)?$/i,
  username: /^[a-zA-Z0-9!@#$%^&*()_+-=]*$/,
  password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[!@#$%^&*()_+])[A-Za-z\d!@#$%^&*()_+]{8,}$/
};
